Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
String simdikiTarihISO() {
  if (!rtcHazir) return "";
  DateTime now = rtc.now();
  if (now.year() < 2024 || now.year() > 2099) return "";
  char buf[16];
  snprintf(buf, sizeof(buf), "%04d-%02d-%02d", now.year(), now.month(), now.day());
  return String(buf);
}

String simdikiYilAy() {
  if (!rtcHazir) return "";
  DateTime now = rtc.now();
  if (now.year() < 2024 || now.year() > 2099) return "";
  char buf[10];
  snprintf(buf, sizeof(buf), "%04d-%02d", now.year(), now.month());
  return String(buf);
}

bool geceModuMu() {
  if (!rtcHazir) return false;
  DateTime now = rtc.now();
  int saat = now.hour();
  int b = ayar.geceBaslangicSaat, e = ayar.geceBitisSaat;
  if (b == e) return false;
  if (b < e) return (saat >= b && saat < e);
  return (saat >= b || saat < e);
}

// ============ NANO HABERLESME ============
// Bekleyen komut kuyruğu - GET_STATUS ile çakışmayı önler
struct NanoPendingCmd {
  String komut;         // "LAMBA_ON", "LAMBA_OFF", vb.
  String ackBeklenen;   // "ACK:LAMBA_ON" vb.
  uint8_t deneme;       // Kaç kez denendi
  unsigned long sonGonderMs;
};
static NanoPendingCmd pendingCmd = {"", "", 0, 0};
static bool nanoMesgul = false; // Yanıt bekleniyor mu?

// Nano'dan gelen yanıtı oku (non-blocking, timeout ms içinde)
String nanoYanitOku(unsigned long timeoutMs) {
  unsigned long bas = millis();
  String yanit = "";
  while (millis() - bas < timeoutMs) {
    if (Serial.available()) {
      char c = Serial.read();
      if (c == '\n') break;
      if (c != '\r') yanit += c;
    }
    yield();
  }
  yanit.trim();
  return yanit;
}

// Status yanıtını ayrıştır
void nanoStatusAyristir(const String& yanit) {
  if (yanit.length() == 0) return;
  nanoBaglantiVar = true;
      kapi1Acik          = (yanit.indexOf("D0=1") >= 0);
      kapi2Acik          = (yanit.indexOf("D1=1") >= 0);
      // PIR artik ayri bir PIN_READ komutuyla degil, GET_STATUS yanitinin
      // kendisinden okunuyor - iki ayri komutu ayni pencerede art arda
      // gondermenin yol actigi zamanlama/kesilme sorunlari ortadan kalkti.
      {
        // SR501 her tetiklenmede ~3sn HIGH / ~5sn LOW dongusunde calisiyor
        // (kendi kilitlenme suresi), o yuzden tek darbenin suresi degil,
        // pencere icindeki AYRI DARBE SAYISI degerlendiriliyor. Her yeni
        // darbenin (pirAcik false->true gecisi) baslangic zamani dairesel
        // tampona yazilir, sonra pencere icinde kalan kayitlar sayilir.
        // Tolerans: RS485/Nano hattinda tek bir okumanin "0" donup darbeyi
        // ikiye bolmesi gibi saf iletisim hatalarina karsi kucuk bir pay -
        // gercek darbeler arasi bosluk (min ~5sn kilitlenme) bundan cok
        // daha buyuk oldugu icin yanlislikla birlesme riski yok.
        bool pirHam = (yanit.indexOf("PIR=1") >= 0);
        unsigned long simdiPir = millis();
        const unsigned long PIR_ILETISIM_TOLERANSI_MS = (unsigned long)NANO_POLL_INTERVAL * 2UL;
        if (pirHam) {
          if (!pirAcik) {
            pirDarbeGecmisi[pirDarbeGecmisiIndex] = simdiPir; // yeni darbe basliyor
            pirDarbeGecmisiIndex = (pirDarbeGecmisiIndex + 1) % PIR_DARBE_GECMISI_BOYUTU;
          }
          pirSonAktifMs = simdiPir;
          pirAcik = true;
        } else if (pirAcik && simdiPir - pirSonAktifMs > PIR_ILETISIM_TOLERANSI_MS) {
          pirAcik = false;
        }

        if (ayar.pirPencereSaniye == 0) {
          pirDarbeSayisiPencerede = pirAcik ? 1 : 0;
          pirTetikleyici = pirAcik; // filtre yok - ham deger aninda gecerli
        } else {
          unsigned long pencereMs = (unsigned long)ayar.pirPencereSaniye * 1000UL;
          uint8_t sayac = 0;
          for (uint8_t i = 0; i < PIR_DARBE_GECMISI_BOYUTU; i++) {
            unsigned long t = pirDarbeGecmisi[i];
            if (t != 0 && simdiPir - t <= pencereMs) sayac++;
          }
          pirDarbeSayisiPencerede = sayac;
          pirTetikleyici = (sayac >= ayar.pirMinTetiklenme);
        }
      }
      roleFizikselDurum  = (yanit.indexOf("RELE=1") >= 0);
      if (yanit.indexOf("POLARITY=") >= 0) rolePolariteHigh = (yanit.indexOf("POLARITY=1") >= 0);
      lambaAcik          = (yanit.indexOf("LAMBA=1") >= 0);
      moistureOutputActive = (yanit.indexOf("MOISTURE=1") >= 0);
      // NOT: Nano'nun GET_STATUS yanitindaki MOISTURE_RAW=/MOISTURE_PCT=
      // ARTIK OKUNMUYOR - gercek nem sensoru Nano'da degil, ESP8266'nin
      // kendi A0 pininde (bkz moistureOku()). Nano'nunkini buraya
      // yazdirmak, ESP8266'nin dogru yerel okumasini periyodik olarak
      // Nano'nun (baglanmamis) A0 gurultusuyle eziyordu - Kalburum
      // panelinde degerin "bir dogru bir en yuksek" sicramasinin sebebi buydu.
}

void nanoPoll() {
  static unsigned long son = 0;
  unsigned long simdi = millis();

  // --- Bekleyen komut varsa önce onu işle (retry dahil) ---
  if (pendingCmd.komut.length() > 0) {
    // Her 150ms'de bir retry (max 3 deneme)
    if (simdi - pendingCmd.sonGonderMs >= 150) {
      if (pendingCmd.deneme >= 3) {
        // 3 denemede de ACK gelmedi - vazgeç, durumu sorgula
        DEBUG_PRINTF("[NANO] RETRY BASARISIZ: %s\n", pendingCmd.komut.c_str());
        pendingCmd = {"", "", 0, 0};
        nanoMesgul = false;
      } else {
        // Serial buffer'ı temizle, komutu gönder
        while (Serial.available()) Serial.read();
        Serial.print(pendingCmd.komut + "\n");
        pendingCmd.deneme++;
        pendingCmd.sonGonderMs = simdi;
        DEBUG_PRINTF("[NANO] Gonderiliyor (deneme %d): %s\n", pendingCmd.deneme, pendingCmd.komut.c_str());

        // Yanıt bekle (80ms - Nano'nun 10ms loop'u + seri gecikme)
        String yanit = nanoYanitOku(80);
        if (yanit.length() > 0 && yanit.indexOf(pendingCmd.ackBeklenen) >= 0) {
          DEBUG_PRINTF("[NANO] ACK alindi: %s\n", yanit.c_str());
          pendingCmd = {"", "", 0, 0};
          nanoMesgul = false;
          son = simdi; // Poll timer'ı sıfırla
        }
        // ACK gelmedi -> bir sonraki döngüde tekrar denenecek
      }
    }
    return; // Pending komut varken GET_STATUS gönderme
  }

  // --- Periyodik GET_STATUS ---
  if (simdi - son < NANO_POLL_INTERVAL) return;
  son = simdi;

  while (Serial.available()) Serial.read(); // Temiz başla
  Serial.print("GET_STATUS\n");

